//  file4.c
//  正序分解整数
//  输入一个非负整数，正序输出它的每一位数字
//  输入：13425
//  输出：1 3 4 2 5
#include <stdio.h>
int main()
{
    int x;
    
    //  scanf("%d", &x);
    //  x = 13425;
    //  x = 13425;
    x = 70000;
    //  13425 / 10000 ->1;
    //  13425 % 10000 ->3425;
    //  10000 / 10 ->1000;
    
    //  3425 / 1000->3;
    //  3425 % 1000->425;
    //  1000 / 10 -> 100;
    
    //  425 / 100-> 4;
    //  425 % 100->25;
    //  100 / 10 ->10;

    //  25/10->2;
    //  25%10->5;
    //  10/10->1;

    //  5/1->5;
    //  5%1->0;
    //  1/10->0;
    int mask = 10000;
    do {
        int d = x /mask;
        //  printf("%d", d);
        //  if ( x > 9 ) {
            
        //  }
        x %= mask;
        mask /= 10;
        printf("x=%d,mask=%d,d=%d\n", x, mask, d);
    } while ( x > 0 );
    printf("\n");
    return 0;
}

/*
该程序输出如下：
当x=13425
x=3425,mask=1000,d=1
x=425,mask=100,d=3
x=25,mask=10,d=4
x=5,mask=1,d=2
x=0,mask=0,d=5

当x=70000
x=0,mask=1000,d=7

*/
