//  file2.c
//  正序分解整数
//  输入一个非负整数，正序输出它的每一位数字
//  输入：13425
//  输出：1 3 4 2 5
#include <stdio.h>
int main()
{
    int x;
    
    //  scanf("%d", &x);
    x = 13425;
    do {
        int d = x%10;           /* 思路是定义变量d，给它赋值x最右边位数的数字 */
        printf("%d", d);       /* 打印该变量d */
        if ( x > 9 ) {          /* 当x>9时，循环还未进行到最后一次，*/
            printf(" ");        /* 所以会顺带输出空格 */
        }
        x /= 10;                /* 使x=x/10，将最右边的数位去掉。*/
    } while ( x>0 );            /* 循环条件是x大于0 */
    printf("\n");
    return 0;
}
//  该程序输出结果为：
//  5 2 4 3 1<--1后面没有空格
